import React from 'react'
import hard1 from '../../images/hard1.jpg';
import ssd1 from '../../images/ssd1.jpg';

const DD = () => {
  return (
    <div className='mt-[60px]' id='disks'>
        <h2 className='text-center text-[25px] font-bold my-[10px]'>Постійний запам'ятовуючі пристрої</h2>
        <div className='flex flex-col gap-4 mt-5'>
            <p>На сьогоднішній день в комп'ютерній техніці використовуються запам'ятовуючі пристрої 2 основних типів - це жорсткі диски (HDD) та SSD. Іноді зустрічаються також "гібриди" SSHD, що поєднують у собі SSD та HDD.</p>
            <div className='flex flex-col gap-[30px] lg:flex-row'>
                <p>
                <span className='font-bold'>Жорсткий диск</span> (накопичувач на жорстких магнітних дисках (НЖМД), "вінчестер", англ. - hard disk drive (HDD) – постійний запам'ятовуючий пристрій, в якому використовується принцип магнітного запису. Всередині цього носія запис даних здійснюється на жорсткі пластини, виготовлені з легкометалевого сплаву або скла і вкриті шаром спеціального магнітного матеріалу (найчастіше двоокис хрому), знаходяться в гермоблоці та швидко обертаються на одній осі.
                </p>
                <img src={hard1} alt="hard1" className='max-w-[500px]' />
            </div>
            <div className='flex flex-col-reverse mt-[40px]'>
                <img src={ssd1} alt="ssd1" className='max-w-[750px] w-full mx-auto mt-[40px]' />
                <p>
                <span className='font-bold'>SSD</span> (solid-state drive) або <span className='font-bold'>твердотільний накопичувач</span> – запам'ятовуючий пристрій, що з'явився значно пізніше за HDD та працює на основі використання мікросхем пам'яті. На відміну від жорсткого диска, він не містить рухомих частин. Конструктивно <span className='font-bold'>SSD</span> має багато спільного зі звичайною флешкою. Це друкована плата, на якій розпаяні кілька енергонезалежних запам'ятовуючих мікросхем, контролер, що керує їх роботою, буфер, а також "допоміжні" елементи, які забезпечують живлення, обмін даними з материнською платою та ін. (на зображенні нижче SSD формату 2.5" без корпусу). По суті, від флешки SSD відрізняється лише продвинутою логікою обробки процесів, більш високими швидкостями читання / запису і більшим обсягом зберігання даних.
                </p>
            </div>
        </div>
    </div>
  )
}

export default DD