import React from 'react'
import gpu1 from '../../images/gpu1.jpg';
import gpu1_1 from '../../images/gpu1-1.jpg';
import gpu2 from '../../images/gpu2.jpg';

const GPU = () => {
  return (
    <div className='mt-[60px]'>
        <h2 className='text-center text-[25px] font-bold my-[10px]'>Відеоадаптери</h2>
        <div className='flex flex-col gap-4 mt-[20px]'>
            <div className='flex gap-[25px] flex-col lg:flex-row items-center lg:items-start'>
                <p className='mt-[50px]'><span className='font-bold'>Відеокарта</span> (відеоадаптер, графічна плата, графічний адаптер, графічна карта, <span className='font-bold'>GPU, Graphics Processing Unit)</span> – важлива і дуже складна складова частина комп'ютера . Можна сказати, що вона є свого роду спеціалізованим комп'ютером, який складається з власного процесора, оперативної пам'яті та інших компонентів, які за своєю структурою та організацією взаємодії між собою пристосованих для максимально ефективного вирішення одного завдання – обробки графічних даних. Основними розробниками відеокарт (графічних чіпів) є американські компанії Nvidia, AMD та Intel.
                </p>
                <img src={gpu1_1} alt="gpu1" className='max-w-[400px]' />
            </div>

            <p className=''>
            Повноцінна відеокарта, яка є самостійним пристроєм, називається дискретною. Вона має окремий графічний процесор, власну відеопам'ять, окрему систему живлення, охолодження тощо. Все це розташоване на окремій платі, чка приєднується до материнської плати комп'ютера (роз'єм PCI-E).
            Як відомо, "серцем" будь-якого комп'ютера є його центральний процесор. Багато процесорів, крім обчислювальних ядер, мають у своєму складі графічний чіп, здатний виконувати функції відеокарти. І якщо в комп'ютері окремої відеокарти немає, а за обробку та виведення на монітор графіки відповідає вбудований у процесор відеочіп, кажуть, що комп'ютер має вбудовану (інтегровану) відеокарту.
            Інтегрована відеокарта дозволяє заощадити на придбанні дискретної картки. Можливостей вбудованого в процесор графічного чіпа достатньо для виконання офісних завдань, перегляду та базової обробки фото та відео, перегляду сторінок Інтернету, та навіть розваг у вигляді простих відеоігор. Деякі інтегровані відеочіпи за швидкодією рівняються з дискретними відеокартами початкового рівня.
            </p>
            <img src={gpu2} alt="gpu2" className='max-w-[570px] mx-auto' />
        </div>
    </div>
  )
}

export default GPU