import React from 'react'
import ram1 from '../../images/ram1.jpg';
import ram2 from '../../images/ram2.jpg';

const RAM = () => {
  return (
    <div className='mt-[60px]' id='RAM'>
        <h2 className='text-center text-[25px] font-bold my-[10px]'>Оперативна пам'ять</h2>
        <div className='flex flex-col gap-4'>
            <p className='mt-[40px]'>
            <span className='font-bold'>Оперативна пам’ять</span> (оперативний запам’ятовуючий пристрій, ОЗП або RAM) – пам’ять, частина системи пам’яті ЕОМ, до якої процесор може звернутися за одну операцію. <span className='font-bold'>Призначена для тимчасового зберігання даних і команд, необхідних процесору для виконання ним операцій.</span> Оперативна пам’ять передає процесору дані безпосередньо, або через кеш-пам’ять. Кожна комірка оперативної пам’яті має свою індивідуальну адресу.
            ОЗП – це швидкий запам'ятовуючий буфер, де тимчасово зберігається інформація, яка в даний момент потрібна або з великою долею ймовірності може знадобитися процесору. ОЗУ є енергозалежною пам’яттю, потребує живлення для підтримання можливості зберігати інформацію. 
            </p>
            <p>
            <span className='font-bold'>Основна функція RAM:</span> <br />
                – визначає допустимий обсяг і швидкість процедур, що одночасно виконуються; <br />
                – тимчасово зберігає дані і команди, необхідні процесору для виконання ним операцій. <br />
            </p>
            <img src={ram1} alt="ram1" className='max-w-[900px] w-full mx-auto' />
            <div className='mt-[40px] flex flex-col lg:flex-row gap-[40px]'>
              <p>
              Не складно здогадатися, що чим швидша оперативна пам'ять комп'ютера і чим її більше, тим краще.
              Загальний обсяг оперативної пам'яті комп'ютера визначається сукупністю обсягів модулів ОЗП, встановлених на материнській платі. Швидкість пам'яті залежить від частоти та затримок (таймінгів) модулів ОЗП, які в свою чергу залежать від типу пам'яті.
              Але не залежно від частоти, принцип роботи оперативної пам'яті всіх зазначених вище типів однаковий. Вона обробляє потік команд процесора як своєрідний конвеєр. Головною особливістю цього конвеєра є те, що при поступанні до ОЗП, наприклад, команди на читання дані на виході з'являються не відразу, а через якийсь час (через деяку кількість тактів). Цей час називається затримкою або таймінгами пам'яті (англ. – SDRAM latency) і чим він коротший, тим оперативна пам'ять комп'ютера швидша. Цей параметр, як і частоту шини, слід враховувати під час вибору ОЗП.
              Всі модулі ОЗП залежно від сфери застосування випускаються у 2 основних форм-факторах: Long-DIMM та SO-DIMM. Long-DIMM призначений для настільних комп'ютерів, SO-DIMM – для ноутбуків та різноманітних міні- комп'ютерів.
              </p>
              <img src={ram2} alt="ram2" className='max-w-[450px] w-full h-full mx-auto' />      
              </div>
        </div>
    </div>
  )
}

export default RAM